ESRGgroup9/slipad/code/third_party/notUsed/STM32_SX1278_433MHz/STM32_SX1278 433MHz Receiver/Source/Drivers/RFsx1276.h
#ifndef __RFSX1276_H
#define __RFSX1276_H
#include <stdint.h>

#include "stm32f10x_gpio.h"
#define bool _Bool
#define true    1
#define false   0
#define inline
#define NULL    0  



typedef struct 	
{
	uint8_t  buffer[50];
	uint8_t  buffer_buckup[50];
  uint8_t  buffer_size;
}RF;


	#ifndef __string_h
	#define __string_h
	//#define __ARMCLIB_VERSION 5030076
	#define _ARMABI __declspec(__nothrow)
				#ifndef __STRING_DECLS
					#define __STRING_DECLS
					#undef __CLIBNS
					#ifdef __cplusplus
							namespace std {
							#define __CLIBNS std::
							extern "C" {
					#else
							#define __CLIBNS
					#endif  /* __cplusplus */
			 #if defined(__cplusplus) || !defined(__STRICT_ANSI__)
					typedef unsigned int size_t;
			 #elif !defined(__size_t)
					#define __size_t 1
					typedef unsigned int size_t;   /* see <stddef.h> */
			 #endif
	#endif
#endif
						
#ifndef __STRICT_ANSI__
extern _ARMABI char *strtok_r(char * /*s1*/, const char * /*s2*/, char ** /*ptr*/) __attribute__((__nonnull__(2,3)));
#endif
extern _ARMABI void *memset(void * /*s*/, int /*c*/, size_t /*n*/) __attribute__((__nonnull__(1)));						
extern _ARMABI void *memcpy(void * __restrict /*s1*/,
const void * __restrict /*s2*/, size_t /*n*/) __attribute__((__nonnull__(1,2)));

#define RESET_IOPORT                                GPIOC
#define RESET_PIN                                   GPIO_Pin_4

#define NSS_IOPORT                                  GPIOA
#define NSS_PIN                                     GPIO_Pin_4

#define DIO0_IOPORT                                 GPIOA
#define DIO0_PIN                                    GPIO_Pin_1

#define DIO1_IOPORT                                 GPIOB
#define DIO1_PIN                                    GPIO_Pin_11 

#define DIO2_IOPORT                                 GPIOB
#define DIO2_PIN                                    GPIO_Pin_10

#define DIO3_IOPORT                                 GPIOB
#define DIO3_PIN                                    GPIO_Pin_1

#define DIO4_IOPORT                                 GPIOB
#define DIO4_PIN                                    GPIO_Pin_0 

#define DIO5_IOPORT                                 GPIOC
#define DIO5_PIN                                    GPIO_Pin_5


typedef enum
{
    RFLR_STATE_IDLE,
    RFLR_STATE_RX_INIT,
    RFLR_STATE_RX_RUNNING,
    RFLR_STATE_RX_DONE,
    RFLR_STATE_RX_TIMEOUT,
    RFLR_STATE_TX_INIT,
    RFLR_STATE_TX_RUNNING,
    RFLR_STATE_TX_DONE,
    RFLR_STATE_TX_TIMEOUT,
    RFLR_STATE_CAD_INIT,
    RFLR_STATE_CAD_RUNNING,
}tRFLRStates;

typedef enum
{
    RF_IDLE,
    RF_BUSY,
    RF_RX_DONE,
    RF_RX_TIMEOUT,
    RF_TX_DONE,
    RF_TX_TIMEOUT,
    RF_LEN_ERROR,
    RF_CHANNEL_EMPTY,
    RF_CHANNEL_ACTIVITY_DETECTED,
}tRFProcessReturnCodes;

typedef enum
{
    RF_STATE_IDLE,
    RF_STATE_RX_INIT,
    RF_STATE_RX_SYNC,
    RF_STATE_RX_RUNNING,
    RF_STATE_RX_DONE,
    RF_STATE_RX_TIMEOUT,
    RF_STATE_RX_LEN_ERROR,
    RF_STATE_TX_INIT,
    RF_STATE_TX_READY_WAIT,
    RF_STATE_TX_RUNNING,
    RF_STATE_TX_DONE,
    RF_STATE_TX_TIMEOUT,
}tRFStates;

typedef enum
{
	RADIO_RESET_OFF,
	RADIO_RESET_ON,
}tRadioResetState;

typedef struct sRadioDriver
{
    void ( *Init )( void );
    void ( *Reset )( void );
    void ( *StartRx )( void );
    void ( *GetRxPacket )( void *buffer, uint16_t *size );
    void ( *SetTxPacket )( const void *buffer, uint16_t size );
    uint32_t ( *Process )( void );
}tRadioDriver;

typedef struct sFskSettings
{
    uint32_t RFFrequency;
    uint32_t Bitrate;
    uint32_t Fdev;
    int8_t Power;
    uint32_t RxBw;
    uint32_t RxBwAfc;
    bool CrcOn;
    bool AfcOn;
    uint8_t PayloadLength;
}tFskSettings;

typedef struct sLoRaSettings
{
    uint32_t RFFrequency;
    int8_t Power;
    uint8_t SignalBw;                   
                                         
    uint8_t SpreadingFactor;            
    uint8_t ErrorCoding;                
    bool CrcOn;                         
    bool ImplicitHeaderOn;              
    bool RxSingleOn;                   
    bool FreqHopOn;                     
    uint8_t HopPeriod;                 
    uint32_t TxPacketTimeout;
    uint32_t RxPacketTimeout;
    uint8_t PayloadLength;
}tLoRaSettings;

typedef struct sSX1276LR
{
    uint8_t RegFifo;                                // 0x00 
    // Common settings
    uint8_t RegOpMode;                              // 0x01 
    uint8_t RegRes02;                               // 0x02 
    uint8_t RegRes03;                               // 0x03 
    uint8_t RegBandSetting;                         // 0x04 
    uint8_t RegRes05;                               // 0x05 
    uint8_t RegFrfMsb;                              // 0x06 
    uint8_t RegFrfMid;                              // 0x07 
    uint8_t RegFrfLsb;                              // 0x08 
    // Tx settings
    uint8_t RegPaConfig;                            // 0x09 
    uint8_t RegPaRamp;                              // 0x0A 
    uint8_t RegOcp;                                 // 0x0B 
    // Rx settings
    uint8_t RegLna;                                 // 0x0C 
    // LoRa registers
    uint8_t RegFifoAddrPtr;                         // 0x0D 
    uint8_t RegFifoTxBaseAddr;                      // 0x0E 
    uint8_t RegFifoRxBaseAddr;                      // 0x0F 
    uint8_t RegFifoRxCurrentAddr;                   // 0x10 
    uint8_t RegIrqFlagsMask;                        // 0x11 
    uint8_t RegIrqFlags;                            // 0x12 
    uint8_t RegNbRxBytes;                           // 0x13 
    uint8_t RegRxHeaderCntValueMsb;                 // 0x14 
    uint8_t RegRxHeaderCntValueLsb;                 // 0x15 
    uint8_t RegRxPacketCntValueMsb;                 // 0x16 
    uint8_t RegRxPacketCntValueLsb;                 // 0x17 
    uint8_t RegModemStat;                           // 0x18 
    uint8_t RegPktSnrValue;                         // 0x19 
    uint8_t RegPktRssiValue;                        // 0x1A 
    uint8_t RegRssiValue;                           // 0x1B 
    uint8_t RegHopChannel;                          // 0x1C 
    uint8_t RegModemConfig1;                        // 0x1D 
    uint8_t RegModemConfig2;                        // 0x1E 
    uint8_t RegSymbTimeoutLsb;                      // 0x1F 
    uint8_t RegPreambleMsb;                         // 0x20 
    uint8_t RegPreambleLsb;                         // 0x21 
    uint8_t RegPayloadLength;                       // 0x22 
    uint8_t RegMaxPayloadLength;                    // 0x23 
    uint8_t RegHopPeriod;                           // 0x24 
    uint8_t RegFifoRxByteAddr;                      // 0x25
    uint8_t RegModemConfig3;                        // 0x26
    uint8_t RegTestReserved27[0x30 - 0x27];         // 0x27-0x30
    uint8_t RegTestReserved31;                      // 0x31
    uint8_t RegTestReserved32[0x40 - 0x32];         // 0x32-0x40
    // I/O settings                
    uint8_t RegDioMapping1;                         // 0x40 
    uint8_t RegDioMapping2;                         // 0x41 
    // Version
    uint8_t RegVersion;                             // 0x42
    // Additional settings
    uint8_t RegAgcRef;                              // 0x43
    uint8_t RegAgcThresh1;                          // 0x44
    uint8_t RegAgcThresh2;                          // 0x45
    uint8_t RegAgcThresh3;                          // 0x46
    // Test
    uint8_t RegTestReserved47[0x4B - 0x47];         // 0x47-0x4A
    // Additional settings
    uint8_t RegPllHop;                              // 0x4B
    uint8_t RegTestReserved4C;                      // 0x4C
    uint8_t RegPaDac;                               // 0x4D
    // Test
    uint8_t RegTestReserved4E[0x58-0x4E];           // 0x4E-0x57
    // Additional settings
    uint8_t RegTcxo;                                // 0x58
    // Test
    uint8_t RegTestReserved59;                      // 0x59
    // Test
    uint8_t RegTestReserved5B;                      // 0x5B
    // Additional settings
    uint8_t RegPll;                                 // 0x5C
    // Test
    uint8_t RegTestReserved5D;                      // 0x5D
    // Additional settings
    uint8_t RegPllLowPn;                            // 0x5E
    // Test
    uint8_t RegTestReserved5F[0x6C - 0x5F];         // 0x5F-0x6B
    // Additional settings
    uint8_t RegFormerTemp;                          // 0x6C
    // Test
    uint8_t RegTestReserved6D[0x71 - 0x6D];         // 0x6D-0x70
}tSX1276LR;

typedef struct sSX1276
{
    uint8_t RegFifo;                                // 0x00
    // Common settings
    uint8_t RegOpMode;                              // 0x01
    uint8_t RegBitrateMsb;                          // 0x02
    uint8_t RegBitrateLsb;                          // 0x03
    uint8_t RegFdevMsb;                             // 0x04
    uint8_t RegFdevLsb;                             // 0x05
    uint8_t RegFrfMsb;                              // 0x06
    uint8_t RegFrfMid;                              // 0x07
    uint8_t RegFrfLsb;                              // 0x08
    // Tx settings
    uint8_t RegPaConfig;                            // 0x09
    uint8_t RegPaRamp;                              // 0x0A
    uint8_t RegOcp;                                 // 0x0B
    // Rx settings
    uint8_t RegLna;                                 // 0x0C
    uint8_t RegRxConfig;                            // 0x0D
    uint8_t RegRssiConfig;                          // 0x0E
    uint8_t RegRssiCollision;                       // 0x0F
    uint8_t RegRssiThresh;                          // 0x10
    uint8_t RegRssiValue;                           // 0x11
    uint8_t RegRxBw;                                // 0x12
    uint8_t RegAfcBw;                               // 0x13
    uint8_t RegOokPeak;                             // 0x14
    uint8_t RegOokFix;                              // 0x15
    uint8_t RegOokAvg;                              // 0x16
    uint8_t RegRes17;                               // 0x17
    uint8_t RegRes18;                               // 0x18
    uint8_t RegRes19;                               // 0x19
    uint8_t RegAfcFei;                              // 0x1A
    uint8_t RegAfcMsb;                              // 0x1B
    uint8_t RegAfcLsb;                              // 0x1C
    uint8_t RegFeiMsb;                              // 0x1D
    uint8_t RegFeiLsb;                              // 0x1E
    uint8_t RegPreambleDetect;                      // 0x1F
    uint8_t RegRxTimeout1;                          // 0x20
    uint8_t RegRxTimeout2;                          // 0x21
    uint8_t RegRxTimeout3;                          // 0x22
    uint8_t RegRxDelay;                             // 0x23
    // Oscillator settings
    uint8_t RegOsc;                                 // 0x24
    // Packet handler settings
    uint8_t RegPreambleMsb;                         // 0x25
    uint8_t RegPreambleLsb;                         // 0x26
    uint8_t RegSyncConfig;                          // 0x27
    uint8_t RegSyncValue1;                          // 0x28
    uint8_t RegSyncValue2;                          // 0x29
    uint8_t RegSyncValue3;                          // 0x2A
    uint8_t RegSyncValue4;                          // 0x2B
    uint8_t RegSyncValue5;                          // 0x2C
    uint8_t RegSyncValue6;                          // 0x2D
    uint8_t RegSyncValue7;                          // 0x2E
    uint8_t RegSyncValue8;                          // 0x2F
    uint8_t RegPacketConfig1;                       // 0x30
    uint8_t RegPacketConfig2;                       // 0x31
    uint8_t RegPayloadLength;                       // 0x32
    uint8_t RegNodeAdrs;                            // 0x33
    uint8_t RegBroadcastAdrs;                       // 0x34
    uint8_t RegFifoThresh;                          // 0x35
    // Sequencer settings
    uint8_t RegSeqConfig1;                          // 0x36
    uint8_t RegSeqConfig2;                          // 0x37
    uint8_t RegTimerResol;                          // 0x38
    uint8_t RegTimer1Coef;                          // 0x39
    uint8_t RegTimer2Coef;                          // 0x3A
    // Service settings
    uint8_t RegImageCal;                            // 0x3B
    uint8_t RegTemp;                                // 0x3C
    uint8_t RegLowBat;                              // 0x3D
    // Status
    uint8_t RegIrqFlags1;                           // 0x3E
    uint8_t RegIrqFlags2;                           // 0x3F
    // I/O settings
    uint8_t RegDioMapping1;                         // 0x40
    uint8_t RegDioMapping2;                         // 0x41
    // Version
    uint8_t RegVersion;                             // 0x42
    // Additional settings
    uint8_t RegAgcRef;                              // 0x43
    uint8_t RegAgcThresh1;                          // 0x44
    uint8_t RegAgcThresh2;                          // 0x45
    uint8_t RegAgcThresh3;                          // 0x46
    // Test
    uint8_t RegTestReserved47[0x4B - 0x47];         // 0x47-0x4A
    // Additional settings
    uint8_t RegPllHop;                              // 0x4B
    uint8_t RegTestReserved4C;                      // 0x4C
    uint8_t RegPaDac;                               // 0x4D
    // Test
    uint8_t RegTestReserved4E[0x58-0x4E];           // 0x4E-0x57
    // Additional settings
    uint8_t RegTcxo;                                // 0x58
    // Test
    uint8_t RegTestReserved59;                      // 0x59
    // Test
    uint8_t RegTestReserved5B;                      // 0x5B
    // Additional settings
    uint8_t RegPll;                                 // 0x5C
    // Test
    uint8_t RegTestReserved5D;                      // 0x5D
    // Additional settings
    uint8_t RegPllLowPn;                            // 0x5E
    // Test
    uint8_t RegTestReserved5F[0x6C - 0x5F];         // 0x5F-0x6B
    // Additional settings
    uint8_t RegFormerTemp;                          // 0x6C
    // Test
    uint8_t RegTestReserved6D[0x70 - 0x6D];         // 0x6D-0x6F
    // Additional settings
    uint8_t RegBitrateFrac;                         // 0x70
}tSX1276;

/*!
 * RF packet definition
 */
#define RF_BUFFER_SIZE_MAX                          256
#define RF_BUFFER_SIZE                              256

/*!
 * SX1276 definitions
 */
// #define XTAL_FREQ                                   26000000
// #define FREQ_STEP                                   49.59106445
#define XTAL_FREQ                                   32000000
#define FREQ_STEP                                   61.03515625

/*!
 * SX1276 Internal registers Address
 */
#define REG_LR_FIFO                                 0x00 
// Common settings
#define REG_LR_OPMODE                               0x01 
#define REG_LR_BANDSETTING                          0x04
#define REG_LR_FRFMSB                               0x06 
#define REG_LR_FRFMID                               0x07
#define REG_LR_FRFLSB                               0x08 
// Tx settings
#define REG_LR_PACONFIG                             0x09 
#define REG_LR_PARAMP                               0x0A 
#define REG_LR_OCP                                  0x0B 
// Rx settings
#define REG_LR_LNA                                  0x0C 
// LoRa registers
#define REG_LR_FIFOADDRPTR                          0x0D 
#define REG_LR_FIFOTXBASEADDR                       0x0E 
#define REG_LR_FIFORXBASEADDR                       0x0F 
#define REG_LR_FIFORXCURRENTADDR                    0x10 
#define REG_LR_IRQFLAGSMASK                         0x11 
#define REG_LR_IRQFLAGS                             0x12 
#define REG_LR_NBRXBYTES                            0x13 
#define REG_LR_RXHEADERCNTVALUEMSB                  0x14 
#define REG_LR_RXHEADERCNTVALUELSB                  0x15 
#define REG_LR_RXPACKETCNTVALUEMSB                  0x16 
#define REG_LR_RXPACKETCNTVALUELSB                  0x17 
#define REG_LR_MODEMSTAT                            0x18 
#define REG_LR_PKTSNRVALUE                          0x19 
#define REG_LR_PKTRSSIVALUE                         0x1A 
#define REG_LR_RSSIVALUE                            0x1B 
#define REG_LR_HOPCHANNEL                           0x1C 
#define REG_LR_MODEMCONFIG1                         0x1D 
#define REG_LR_MODEMCONFIG2                         0x1E 
#define REG_LR_SYMBTIMEOUTLSB                       0x1F 
#define REG_LR_PREAMBLEMSB                          0x20 
#define REG_LR_PREAMBLELSB                          0x21 
#define REG_LR_PAYLOADLENGTH                        0x22 
#define REG_LR_PAYLOADMAXLENGTH                     0x23 
#define REG_LR_HOPPERIOD                            0x24 
#define REG_LR_FIFORXBYTEADDR                       0x25
#define REG_LR_MODEMCONFIG3                         0x26
// end of documented register in datasheet
// I/O settings
#define REG_LR_DIOMAPPING1                          0x40
#define REG_LR_DIOMAPPING2                          0x41
// Version
#define REG_LR_VERSION                              0x42
// Additional settings
#define REG_LR_PLLHOP                               0x44
#define REG_LR_TCXO                                 0x4B
#define REG_LR_PADAC                                0x4D
#define REG_LR_FORMERTEMP                           0x5B
#define REG_LR_BITRATEFRAC                          0x5D
#define REG_LR_AGCREF                               0x61
#define REG_LR_AGCTHRESH1                           0x62
#define REG_LR_AGCTHRESH2                           0x63
#define REG_LR_AGCTHRESH3                           0x64

#define RFLR_OPMODE_LONGRANGEMODE_MASK              0x7F 
#define RFLR_OPMODE_LONGRANGEMODE_OFF               0x00 // Default
#define RFLR_OPMODE_LONGRANGEMODE_ON                0x80 

#define RFLR_OPMODE_ACCESSSHAREDREG_MASK            0xBF 
#define RFLR_OPMODE_ACCESSSHAREDREG_ENABLE          0x40 
#define RFLR_OPMODE_ACCESSSHAREDREG_DISABLE         0x00 // Default

#define RFLR_OPMODE_FREQMODE_ACCESS_MASK            0xF7
#define RFLR_OPMODE_FREQMODE_ACCESS_LF              0x08 // Default
#define RFLR_OPMODE_FREQMODE_ACCESS_HF              0x00 

#define RFLR_OPMODE_MASK                            0xF8 
#define RFLR_OPMODE_SLEEP                           0x00 
#define RFLR_OPMODE_STANDBY                         0x01 // Default
#define RFLR_OPMODE_SYNTHESIZER_TX                  0x02 
#define RFLR_OPMODE_TRANSMITTER                     0x03 
#define RFLR_OPMODE_SYNTHESIZER_RX                  0x04 
#define RFLR_OPMODE_RECEIVER                        0x05 
// LoRa specific modes
#define RFLR_OPMODE_RECEIVER_SINGLE                 0x06 
#define RFLR_OPMODE_CAD                             0x07 
/*!
 * RegBandSetting 
 */
#define RFLR_BANDSETTING_MASK                    0x3F 
#define RFLR_BANDSETTING_AUTO                    0x00 // Default
#define RFLR_BANDSETTING_DIV_BY_1                0x40
#define RFLR_BANDSETTING_DIV_BY_2                0x80
#define RFLR_BANDSETTING_DIV_BY_6                0xC0

/*!
 * RegFrf (MHz)
 */
#define RFLR_FRFMSB_434_MHZ                         0x6C // Default
#define RFLR_FRFMID_434_MHZ                         0x80 // Default
#define RFLR_FRFLSB_434_MHZ                         0x00 // Default

